case/outputs_steady/openfoam_cases/section_2_x23p1km/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 2.4714);

boundaryField
{
    inlet   { type fixedValue; value uniform (0 0 2.4714); }
    outlet  { type pressureInletOutletVelocity; value uniform (0 0 0); }
    walls   { type noSlip; }
}
