case/outputs_steady/openfoam_cases/section_2_x23p1km/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volScalarFieldValue alpha.liquid 0 );

regions
(
    boxToCell
    {
        box (-0.12725 -0.12725 -0.01) (0.12725 -0.051383 3.064);
        fieldValues ( volScalarFieldValue alpha.liquid 1 );
    }
);
